In [1]:
import pandas as pd

In [2]:
filas = 'ventas1 ventas2 ventas3'.split()
filas

['ventas1', 'ventas2', 'ventas3']

In [3]:
columnas = 'zonaA zonaB zonaC'.split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [4]:
datos = [[120,340,250],[210,450,250],[310,210,140]]
datos

[[120, 340, 250], [210, 450, 250], [310, 210, 140]]

In [6]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [7]:
condicion = dataframe > 200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    340  250.0
ventas2  210.0    450  250.0
ventas3  310.0    210    NaN

In [8]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [9]:
condicion = dataframe['zonaA'] > 200

In [10]:
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    210    450    250
ventas3    310    210    140

In [11]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [14]:
condicion = (dataframe['zonaA'] > 200) & (dataframe['zonaB'] > 300)

In [15]:
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    210    450    250

In [16]:
condicion = (dataframe['zonaA'] > 200) | (dataframe['zonaB'] > 300)

In [17]:
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140